src/cf/Catalogs/ДокументыРеализацииПолномочийНалоговыхОрганов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДокументыРеализацииПолномочийНалоговыхОрганов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Comment>Вид налогового документа</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалоговыхДокументов</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДокумента</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/СтатусыОтправки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СтатусыОтправки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыОтправки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьОтправкиФСС</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтправкиФСС</v8:Type>
						<v8:Type>cfg:CatalogRef.ОтправкиОтчетности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УдалитьЗапросНаИнформационноеОбслуживаниеНалогоплательщика</v8:Type>
						<v8:Type>cfg:DocumentRef.СправкиНДФЛДляПередачиВНалоговыйОрган</v8:Type>
						<v8:Type>cfg:DocumentRef.РеестрДСВ_3</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовАДВ_2</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеПредставленияРегламентированныхОтчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьПерепискаСКонтролирующимиОрганами</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПередачаДСВвПФР</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСведенияОВзносахИСтраховомСтажеСПВ1</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьАнкетаЗастрахованногоЛица</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСЗВ_6_4</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаИнформационноеОбслуживаниеНалогоплательщика</v8:Type>
						<v8:Type>cfg:CatalogRef.КомплектыОтчетностиПерсучета</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗапросНаИнформационноеОбслуживаниеСтрахователя</v8:Type>
						<v8:Type>cfg:CatalogRef.ПерепискаСКонтролирующимиОрганами</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовАДВ_3</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСЗВ_К</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСПВ_2</v8:Type>
						<v8:Type>cfg:CatalogRef.ОписиИсходящихДокументовВНалоговыеОрганы</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПачкаДокументовСПВ_2</v8:Type>
						<v8:Type>cfg:CatalogRef.ОписиВходящихДокументовИзНалоговыхОрганов</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСЗВ_6_1</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовАДВ_1</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявлениеОВвозеТоваров</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыРеализацииПолномочийНалоговыхОрганов</v8:Type>
						<v8:Type>cfg:DocumentRef.ОписьПачекСЗВ_6</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСПВ_1</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПачкаДокументовСЗВ_6_4</v8:Type>
						<v8:Type>cfg:DocumentRef.РегламентированныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСведенияОНачисленномЗаработкеСЗВ63</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовСЗВ_6_3</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьЗаявлениеОбОбменеДубликатеСтраховогоСвидетельства</v8:Type>
						<v8:Type>cfg:DocumentRef.ПачкаДокументовДСВ_1</v8:Type>
						<v8:Type>cfg:DocumentRef.УведомлениеОСпецрежимахНалогообложения</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДокументыРеализацииПолномочийНалоговыхОрганов</v8:Type>
						<v8:Type>cfg:DocumentRef.РеестрСЗВ_6_2</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьЭлектронныеПредставленияРегламентированныхОтчетов</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьПередачаСЗВ4вПФР</v8:Type>
						<v8:Type>cfg:DocumentRef.ВедомостьУплатыАДВ_11</v8:Type>
						<v8:Type>cfg:DocumentRef.УдалитьСправкаПоНДФЛВНалоговыйОрган</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ТипыЦикловОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЦикловОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НалоговаяИлиБухгалтерскаяОтчетность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеформализованныеДокументыНалоговогоОргана</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеформализованныеДокументыНалогоплательщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросыНаИнформационноеОбслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеформализованнаяПерепискаПФРВходящие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеформализованнаяПерепискаПФРИсходящие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Форма2НДФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбращениеНП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПисьмоНО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассылкаГрупповая</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетностьФСГС</Name>
					<Comment>ОтчетСтат</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПисьменноеОбращениеВФСГС</Name>
					<Comment>ПисьмоРеспондент</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИндивидуальноеИнформированиеФСГС</Name>
					<Comment>ПисьмоОрганФСГС</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассылкаФСГС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗаявление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДокумент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заявление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Представление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИОС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗапросНаВыпискуИзЕГРЮЛ_ЕГРИП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ОписиВходящихДокументовИзНалоговыхОрганов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ОписиВходящихДокументовИзНалоговыхОрганов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НалоговыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеОрганы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВходящиеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СсылкаНаОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДокументыРеализацииПолномочийНалоговыхОрганов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/ДокументыРеализацииПолномочийНалоговыхОрганов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	// инициализируем контекст ЭДО - модуль обработки
	ТекстСообщения = "";
	КонтекстЭДО = ДокументооборотСКОВызовСервера.ПолучитьОбработкуЭДО(ТекстСообщения);
	Если КонтекстЭДО = Неопределено Тогда 
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
	
	КонтекстЭДО.ОбработкаПолученияФормы("Справочник", "ДокументыРеализацииПолномочийНалоговыхОрганов", ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

// Обработчик обновления БРО 1.0.1.41
//
Процедура ОбновитьДокументыРеализацииПолномочийНалоговыхОрганов() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦиклыОбмена.Ссылка КАК ЦиклОбменаСсылка,
		|	ЦиклыОбмена.ВнешняяОрганизация КАК ЦиклОбменаВнешняяОрганизация,
		|	ЦиклыОбмена.Организация КАК ЦиклОбменаОрганизация,
		|	ЦиклыОбмена.Предмет КАК Предмет,
		|	ЦиклыОбмена.Предмет.ДатаСообщения КАК ПредметДатаСообщения,
		|	ЦиклыОбмена.Предмет.ДатаОтправки КАК ПредметДатаОтправки,
		|	ЦиклыОбмена.Предмет.Идентификатор КАК ПредметИдентификатор,
		|	ЦиклыОбмена.Предмет.ИдентификаторОснования КАК ПредметИдентификаторОснования,
		|	ЦиклыОбменаДополнительныеПредметы.Предмет КАК ДопПредмет,
		|	СтатусыОтправки.Статус КАК СтатусОтправкиПредмета
		|ИЗ
		|	Справочник.ЦиклыОбмена КАК ЦиклыОбмена
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыОтправки КАК СтатусыОтправки
		|		ПО ЦиклыОбмена.Предмет = СтатусыОтправки.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ЦиклыОбмена.ДополнительныеПредметы КАК ЦиклыОбменаДополнительныеПредметы
		|		ПО (ЦиклыОбменаДополнительныеПредметы.Ссылка = ЦиклыОбмена.Ссылка)
		|ГДЕ
		|	ЦиклыОбмена.Тип = &ТипЦиклаДокумент
		|	И ЦиклыОбмена.Предмет ССЫЛКА Справочник.ДокументыРеализацииПолномочийНалоговыхОрганов
		|ИТОГИ ПО
		|	ЦиклОбменаСсылка,
		|	СтатусОтправкиПредмета";

	Запрос.УстановитьПараметр("ТипЦиклаДокумент", Перечисления.ТипыЦикловОбмена.Документ);
	Запрос.УстановитьПараметр("ТипСодержимогоДокумент", Перечисления.ТипыСодержимогоТранспортногоКонтейнера.Документ);

	Результат = Запрос.Выполнить();
	
	ВыборкаСсылка = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	НачатьТранзакцию();
	
	Пока ВыборкаСсылка.Следующий() Цикл
		
		// создаем документ опись входящих документов в ИБ
		ОписьДокументов = Справочники.ОписиВходящихДокументовИзНалоговыхОрганов.СоздатьЭлемент();
		ОписьДокументов.НалоговыйОрган 			= ВыборкаСсылка.ЦиклОбменаВнешняяОрганизация;
		ОписьДокументов.Организация 			= ВыборкаСсылка.ЦиклОбменаОрганизация;
		ОписьДокументов.Идентификатор 			= ВыборкаСсылка.ПредметИдентификатор;
		ОписьДокументов.ИдентификаторОснования 	= ВыборкаСсылка.ПредметИдентификаторОснования;
		ОписьДокументов.ДатаСообщения 			= ВыборкаСсылка.ПредметДатаСообщения;
		ОписьДокументов.ДатаОтправки 			= ВыборкаСсылка.ПредметДатаОтправки;
		
		ОписьДокументов.Наименование = "Опись входящих документов от НО " + ОписьДокументов.НалоговыйОрган + " от " + Формат(ОписьДокументов.ДатаСообщения, "ДЛФ=D");
		
		// начинаем заполнять табличную часть
		// первый предмет
		НоваяСтрока = ОписьДокументов.ВходящиеДокументы.Добавить();
		НоваяСтрока.СсылкаНаОбъект = ВыборкаСсылка.Предмет;
		
		ВыборкаСтатусОтправки = ВыборкаСсылка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если ВыборкаСтатусОтправки.Следующий() Тогда
			
			СтатусОтправки = ВыборкаСтатусОтправки.СтатусОтправкиПредмета;
			
			ВыборкаДетальныеЗаписи = ВыборкаСтатусОтправки.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДопПредмет) Тогда
					НоваяСтрока = ОписьДокументов.ВходящиеДокументы.Добавить();
					НоваяСтрока.СсылкаНаОбъект = ВыборкаДетальныеЗаписи.ДопПредмет;
				КонецЕсли;
			КонецЦикла;
			
		КонецЕсли;
		
				
		Попытка
			ОписьДокументов.ОбменДанными.Загрузка = Истина;
			ОписьДокументов.Записать();
			
			// скопировать статус отправки с предыдущего предмета
			МенЗап = РегистрыСведений.СтатусыОтправки.СоздатьМенеджерЗаписи();
			МенЗап.Объект = ОписьДокументов.Ссылка;
			МенЗап.Статус = СтатусОтправки;
			МенЗап.Записать(Истина);
			
			// замена предметов цикла обмена  на один предмет – элемент нового справочника
			ЦиклОбменаОбъект = ВыборкаСсылка.ЦиклОбменаСсылка.ПолучитьОбъект();
			ЦиклОбменаОбъект.ДополнительныеПредметы.Очистить();
			ЦиклОбменаОбъект.Предмет = ОписьДокументов.Ссылка;
			
			ЦиклОбменаОбъект.ОбменДанными.Загрузка = Истина;
			
			ЦиклОбменаОбъект.Записать();

		Исключение
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
		
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
КонецПроцедуры

#КонецЕсли
